// =====================================================================
// - - - - - - - - - - - D A T A S - - - - - - - - - - - - - - -
// =====================================================================

//Latitudes et longitudes des différentes villes :
export const cities = {
  Nantes: {
    lat: 47.2184,
    lon: -1.5536,
  },
  Paris: {
    lat: 48.8566,
    lon: 2.3522,
  },
  Rennes: {
    lat: 48.1173,
    lon: -1.6778,
  },
  Caen: {
    lat: 49.1829,
    lon: -0.3707,
  },
  Marseille: {
    lat: 43.2965,
    lon: 5.3698,
  },
  Mesanger: {
    lat: 47.4328,
    lon: -1.2312,
  },
  Quimper: {
    lat: 47.996,
    lon: -4.0979,
  },
};

// Interprétation simplifiée des codes météo :
export const weatherCodes = {
  0: "☀️",
  1: "🌤️",
  2: "⛅",
  3: "☁️",
  45: "🌫️",
  48: "🌫️",
  51: "🌦️",
  53: "🌦️",
  55: "🌦️",
  56: "🌧️",
  57: "🌧️",
  61: "🌧️",
  63: "🌧️",
  65: "🌧️",
  66: "🌨️",
  67: "🌨️",
  71: "❄️",
  73: "❄️",
  75: "❄️",
  77: "🌨️",
  80: "🌦️",
  81: "🌦️",
  82: "⛈️",
  85: "❄️",
  86: "❄️",
  95: "⛈️",
};
